//
// Created by 15403 on 2021/2/2.
//
/*
 * 要求一:编写一个程序，用户输入待查询年月份（输入格式：2015-03），输出该月份的 PM2.5 值。
 * 要求二:将所有记录的数据打印为横向直方图。*/
#include <stdio.h>

int main() {
    double pm[3][12] = {
            {-1,   -1,   -1,   -1,   -1,   -1,   -1,   31.3, 35.5, 58.7, 49.6, 55.5},
            {59.8, 54.9, 33.1, 38.2, 26.6, 20.5, 27.8, 38.5, 41.5, 44.7, 38.1, 41.5},
            {34.9, 36.4, 47.5, 37.9, 30.6, 23.4, 26.6, 34.3, -1,   -1,   -1,   -1}
    };
    printf("请输入待查询的年月份(年-月):");
    int year, month;
    scanf("%d", &year);
    getchar();
    scanf("%d", &month);
    if (pm[year - 2014][month - 1] > 0) {
        printf("%d年%d月广州市的PM2.5值是%.1f", year, month, pm[year - 2014][month - 1]);
    } else {
        printf("抱歉,该月份未收录数据");
    }
    printf("\n***************************************************************\n");

    for (int i = 0; i < 3; i++) {
        for (int j = 0; j < 12; ++j) {
            if (pm[i][j] - 19 > 0) {
                printf("%d年%2d月: ", i + 2014, j + 1);
                int temp = pm[i][j] - 19;
                for (int k = 0; k < temp; ++k) {
                    printf("*");
                }
                printf("\n");
            }
        }
    }

    return 0;
}